# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.12-s068_1 on Fri Mar 13 16:06:03 PDT 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design systolic_ctrl

create_clock -name "clk" -period 20.0 -waveform {0.0 10.0} [get_ports clk_i]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[0][7]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[0][6]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[0][5]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[0][4]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[0][3]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[0][2]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[0][1]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[0][0]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[1][7]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[1][6]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[1][5]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[1][4]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[1][3]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[1][2]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[1][1]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[1][0]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[2][7]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[2][6]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[2][5]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[2][4]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[2][3]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[2][2]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[2][1]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[2][0]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[3][7]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[3][6]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[3][5]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[3][4]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[3][3]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[3][2]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[3][1]}]
set_load -pin_load 0.005 [get_ports {activations_skewed_o[3][0]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][31]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][30]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][29]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][28]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][27]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][26]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][25]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][24]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][23]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][22]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][21]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][20]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][19]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][18]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][17]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][16]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][15]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][14]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][13]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][12]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][11]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][10]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][9]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][8]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][7]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][6]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][5]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][4]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][3]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][2]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][1]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[0][0]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][31]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][30]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][29]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][28]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][27]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][26]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][25]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][24]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][23]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][22]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][21]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][20]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][19]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][18]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][17]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][16]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][15]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][14]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][13]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][12]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][11]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][10]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][9]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][8]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][7]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][6]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][5]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][4]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][3]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][2]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][1]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[1][0]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][31]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][30]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][29]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][28]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][27]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][26]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][25]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][24]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][23]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][22]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][21]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][20]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][19]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][18]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][17]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][16]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][15]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][14]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][13]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][12]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][11]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][10]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][9]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][8]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][7]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][6]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][5]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][4]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][3]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][2]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][1]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[2][0]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][31]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][30]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][29]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][28]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][27]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][26]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][25]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][24]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][23]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][22]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][21]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][20]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][19]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][18]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][17]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][16]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][15]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][14]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][13]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][12]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][11]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][10]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][9]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][8]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][7]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][6]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][5]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][4]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][3]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][2]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][1]}]
set_load -pin_load 0.005 [get_ports {final_psums_o[3][0]}]
set_load -pin_load 0.005 [get_ports b_is_weight]
set_load -pin_load 0.005 [get_ports input_valid_to_pe]
set_load -pin_load 0.005 [get_ports ready_o]
set_load -pin_load 0.005 [get_ports output_valid]
group_path -weight 1.000000 -name cg_enable_group_clk -through [list \
  [get_pins CLKGATE_RC_CG_HIER_INST0/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST0/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST1/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST1/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST2/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST2/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST3/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST3/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST4/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST4/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST5/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST5/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST6/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST6/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST7/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST7/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST8/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST8/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST9/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST9/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST10/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST10/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST11/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST11/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST12/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST12/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST0/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST0/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST1/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST1/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST2/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST2/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST3/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST3/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST4/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST4/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST5/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST5/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST6/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST6/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST7/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST7/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST8/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST8/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST9/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST9/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST10/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST10/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST11/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST11/RC_CGIC_INST/GATE]  \
  [get_pins CLKGATE_RC_CG_HIER_INST12/enable]  \
  [get_pins CLKGATE_RC_CG_HIER_INST12/RC_CGIC_INST/GATE] ]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports rst_i]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {num_input_rows[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[0][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[0][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[0][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[0][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[0][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[0][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[0][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[0][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[1][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[1][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[1][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[1][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[1][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[1][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[1][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[1][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[2][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[2][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[2][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[2][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[2][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[2][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[2][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[2][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[3][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[3][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[3][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[3][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[3][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[3][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[3][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_i[3][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[0][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[1][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[2][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {psums_staggered_i[3][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[0][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[0][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[0][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[0][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[0][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[0][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[0][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[0][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[1][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[1][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[1][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[1][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[1][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[1][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[1][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[1][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[2][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[2][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[2][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[2][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[2][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[2][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[2][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[2][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[3][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[3][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[3][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[3][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[3][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[3][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[3][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {activations_skewed_o[3][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[0][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[1][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[2][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports {final_psums_o[3][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports b_is_weight]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports input_valid_to_pe]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports ready_o]
set_output_delay -clock [get_clocks clk] -add_delay -max 7.0 [get_ports output_valid]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports rst_i]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {num_input_rows[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[0][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[0][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[0][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[0][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[0][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[0][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[0][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[0][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[1][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[1][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[1][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[1][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[1][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[1][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[1][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[1][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[2][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[2][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[2][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[2][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[2][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[2][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[2][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[2][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[3][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[3][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[3][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[3][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[3][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[3][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[3][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_i[3][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[0][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[1][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[2][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {psums_staggered_i[3][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[0][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[0][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[0][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[0][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[0][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[0][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[0][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[0][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[1][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[1][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[1][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[1][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[1][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[1][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[1][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[1][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[2][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[2][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[2][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[2][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[2][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[2][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[2][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[2][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[3][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[3][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[3][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[3][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[3][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[3][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[3][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {activations_skewed_o[3][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][31]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][30]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][29]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][28]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][27]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][26]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][25]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][24]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][23]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][22]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][21]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][20]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[0][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][31]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][30]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][29]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][28]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][27]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][26]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][25]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][24]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][23]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][22]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][21]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][20]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[1][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][31]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][30]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][29]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][28]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][27]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][26]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][25]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][24]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][23]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][22]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][21]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][20]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[2][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][31]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][30]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][29]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][28]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][27]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][26]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][25]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][24]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][23]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][22]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][21]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][20]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][19]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][18]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][17]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][16]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports {final_psums_o[3][0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports b_is_weight]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports input_valid_to_pe]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports ready_o]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.0 [get_ports output_valid]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__probe_p_8]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__probec_p_8]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfbbn_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfbbn_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfbbp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrbp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrbp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrtn_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrtp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrtp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfrtp_4]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfsbp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfsbp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfstp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfstp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfstp_4]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxbp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxbp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxtp_1]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxtp_2]
set_dont_use true [get_lib_cells sky130_fd_sc_hd__ss_100C_1v60/sky130_fd_sc_hd__sdfxtp_4]
set_clock_uncertainty -setup 0.6 [get_clocks clk]
set_clock_uncertainty -hold 0.6 [get_clocks clk]
